# 2. Выполнить логические побитовые операции «И», «ИЛИ» и др.
# над числами 5 и 6. Выполнить над числом 5 побитовый сдвиг
# вправо и влево на два знака. Объяснить полученный результат.
# https://drive.google.com/file/d/1CCA8Wb24KnOEi294vUghqHcRUUDY4Dvq/view?usp=sharing

n = 5  # 101
m = 6  # 110
print(n & m)   # AND -> 100(2) = 4(10)
print(n | m)   # OR -> 111(2) = 7(10)
print(n ^ m)   # XOR -> 11(2) = 3(10)
print(n >> 2)  # вправо (//4) -> 5 // 4 = 1
print(n << 2)  # влево (*4) -> 5 * 4 = 20

# A | B | A & B (AND)
# 0 | 0 | 0
# 0 | 1 | 0
# 1 | 0 | 0
# 1 | 1 | 1

# A | B | A | B (OR)
# 0 | 0 | 0
# 0 | 1 | 1
# 1 | 0 | 1
# 1 | 1 | 1

# A | B | A ^ B (XOR)
# 0 | 0 | 0
# 0 | 1 | 1
# 1 | 0 | 1
# 1 | 1 | 0


